[
    {
        "headline": "Mollie Rouse leaves Sunderland Women for Spokane Zephyr",
        "link": "https://shekicks.net/mollie-rouse-leaves-sunderland-women-for-spokane-zephyr/",
        "image": "https://shekicks.net/wp-content/uploads/2024/06/Sunderland-v-Durham-FA-Womens-Continental-Tyres-League-Cup-326x245.jpg",
        "summary": "Midfielder Mollie Rouse has left Sunderland to return to the States with Spokane Zephyr FC in the new USL Super League. The 25-year-old, who has been capped by England up to U-21 level, had a […]"
    },
    {
        "headline": "Arsenal Women’s Laura Wienroither signs new contract",
        "link": "https://shekicks.net/arsenal-womens-laura-wienroither-sign-new-contract/",
        "image": "https://shekicks.net/wp-content/uploads/2024/06/Manchester-City-v-Arsenal-Barclays-FA-Womens-Super-League-Academy-Stadium-326x245.jpg",
        "summary": "Arsenal’s 25-year-old Austrian international defender Laura Wienroither has signed a new contract, as she closes in on 50 appearances for the Gunners. She joined from TSG 1899 Hoffenheim in January 2022 but missed much of […]"
    },
    {
        "headline": "Late goals see Cliftonville and Glentoran into Toalsbet Cup semi-finals",
        "link": "https://shekicks.net/late-goals-see-cliftonville-and-glentoran-into-toalsbet-cup-semi-finals/",
        "image": "https://shekicks.net/wp-content/uploads/2024/06/Crusaders-Strikers-v-Glentoran-326x245.jpg",
        "summary": "Cliftonville, Glentoran, Linfield and Lisburn Rangers all won away in the Toalsbet County Antrim Women’s Cup quarter-finals on Monday evening. Glentoran made an 86th-minute breakthrough for the only goal of the game at Crusaders Strikers. […]"
    },
    {
        "headline": "Women’s & girls’ open training / trials – Summer 2024",
        "link": "https://shekicks.net/womens-girls-open-training-trials-summer-2024/",
        "image": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
        "summary": "Here is our summer 2024 free listing for clubs recruiting players for their women’s or girls’ teams, as well as voluntary staff. Beds & Herts Apsley – Recruiting players for girls teams and also a […]"
    },
    {
        "headline": "NIWFA Championship League Cup semi-finalists confirmed",
        "link": "https://shekicks.net/niwfa-championship-league-cup-semi-finalists-confirmed-2/",
        "image": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
        "summary": "Ballymena United, Belfast Celtic, St James Swifts and Sion Swifts all made the NIWFA Championship League Cup semi-finals. St James found theirs the easiest path of progress, defeating Comber Rec 6-0 with Chloe Doak and […]"
    },
    {
        "headline": "Ellen White first female to find the net at Unicef SoccerAid",
        "link": "https://shekicks.net/ellen-white-first-female-to-find-the-net-at-unicef-socceraid/",
        "image": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
        "summary": "Ellen White became the first woman to score at a Unicef SoccerAid Charity match, for an England Xl against the World XI at Stamford Bridge.  White tapped in a cross from Jack Wilshere to help […]"
    },
    {
        "headline": "Flint Town United and Penybont promoted to Adran Leagues",
        "link": "https://shekicks.net/flint-town-united-and-penybont-promoted-to-adran-leagues/",
        "image": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
        "summary": "The FA of Wales has confirmed Women’s National Leagues composition for 2024-25, with Flint Town United and Penybont promoted to the second tier. Flint Town won the North Wales League East in only their second […]"
    },
    {
        "headline": "Larne off the mark in Sports Direct Women’s Premiership",
        "link": "https://shekicks.net/larne-off-the-mark-in-sports-direct-womens-premiership/",
        "image": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
        "summary": "Glentoran, Cliftonville and Derry City all cruised to victories in the Sports Direct Women’s Premiership, while Larne collected their first point of the campaign. Larne picked up their first point in a scoreless draw with […]"
    },
    {
        "headline": "Ballymena United Women clash with Coleraine in Electric Ireland Cup",
        "link": "https://shekicks.net/ballymena-united-women-clash-with-coleraine-in-electric-ireland-cup/",
        "image": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
        "summary": "Ballymena United Women have been drawn against Coleraine in the Electric Ireland Challenge Cup First Round. Wellington Rec welcome Sion Swifts, Greenisland take on Craigavon City, Antrim Town face Donegal Celtic, Bangor Ladies have a […]"
    },
    {
        "headline": "N.Ireland and Scotland grouped together in UEFA Women’s U-17 draw",
        "link": "https://shekicks.net/n-ireland-and-scotland-grouped-together-in-uefa-womens-u-17-draw/",
        "image": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
        "summary": "Northern Ireland and Scotland are in the same 2024/25 UEFA Women’s U-17 Championship Round 1 group, alongside Iceland and Poland. England’s opponents are Netherlands, Czechia and Faroe Islands, who host the finals from 4-17 May […]"
    }
]